; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob80) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 distributor0)
	(clear crate1)
	(at pallet2 distributor1)
	(clear crate3)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 315)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 220)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(= (weight crate0) 30)
	(at crate1 distributor0)
	(on crate1 pallet1)
	(= (weight crate1) 70)
	(at crate2 distributor1)
	(on crate2 crate0)
	(= (weight crate2) 31)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 19)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate2)
		(on crate1 pallet2)
		(on crate2 pallet1)
		(on crate3 crate1)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist1 crate1 pallet1 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 4
2. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 4
3. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 70
   goals met: 0 of 4
4. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 4
5. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 4
6. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 22 to 32
   goals met: 0 of 4
7. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 32 to 42
   goals met: 0 of 4
8. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 70 to 89
   goals met: 0 of 4
9. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   changed: (fuel-cost) from 42 to 43
   goals met: 0 of 4
10. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 89 to 120
   goals met: 0 of 4
11. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 43 to 53
   goals met: 0 of 4
12. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   changed: (fuel-cost) from 53 to 54
   goals met: 0 of 4
13. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 120 to 150
   goals met: 0 of 4
14. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 150 to 80
   goals met: 0 of 4
15. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 54 to 64
   goals met: 0 of 4
16. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 70
   goals met: 0 of 4
17. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   changed: (current_load truck0) from 80 to 49
   goals met: 0 of 4
18. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 64 to 74
   goals met: 0 of 4
19. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 49 to 30
   goals met: 0 of 4
20. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 74 to 84
   goals met: 0 of 4
21. (drop hoist1 crate2 pallet1 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 pallet1)
   goals met: 1 of 4
22. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 30 to 0
   goals met: 1 of 4
23. (drop hoist1 crate0 crate2 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate2)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate2)
   goals met: 2 of 4
24. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 70 to 89
   goals met: 2 of 4
25. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 89 to 19
   goals met: 2 of 4
26. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 3 of 4
27. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 19 to 0
   goals met: 3 of 4
28. (drop hoist2 crate3 crate1 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate1)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate1)
   goals met: 4 of 4
